Конфигурация/Catalogs/ДенежныеПотокиПоОблигациям.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>ДенежныеПотокиПоОблигациям</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Облигации</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаРасчетаПотока</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Поток</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Купон</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Конфигурация/InformationRegisters/ЗначенияНастроекУчетаЦенныхБумаг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ЗначенияНастроекУчетаЦенныхБумаг</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗначениеНастройки</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.НастройкиУчетаЦенныхБумаг</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отключить</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УчетныйАктивЕПС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчетныеАктивыЕПС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Рынок</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РынкиЦенныхБумаг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЦеннаяБумага</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумаги</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Настройка</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.НастройкиУчетаЦенныхБумаг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Партия</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтрокаПартии</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.СтрокаПартии</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/Catalogs/ДенежныеПотокиПоОблигациям/Ext/ObjectModule.bsl
Процедура ПередЗаписью(Отказ)

	// установим новый код - хэш потока по МД5
	ЭтотОбъект.Код = Справочники.ДенежныеПотокиПоОблигациям.ПолучитьХэш(ЭтотОбъект);
	
	Если НЕ ЭтотОбъект.ЭтоНовый() И НЕ ДополнительныеСвойства.Свойство("ПересчетХэшей") Тогда
		// нельзя записывать потоки, если на него есть ссылки
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
			|	ЗначенияНастроекУчетаЦенныхБумаг.Период КАК Период
			|ИЗ
			|	РегистрСведений.ЗначенияНастроекУчетаЦенныхБумаг КАК ЗначенияНастроекУчетаЦенныхБумаг
			|ГДЕ
			|	ЗначенияНастроекУчетаЦенныхБумаг.ЗначениеНастройки = &ЗначениеНастройки";
		
		Запрос.УстановитьПараметр("ЗначениеНастройки", ЭтотОбъект.Ссылка);
		
		УстановитьПривилегированныйРежим(Истина);
		Отказ = НЕ Запрос.Выполнить().Пустой();
		УстановитьПривилегированныйРежим(Ложь);
		
        Если Отказ Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Нельзя изменять значение потоков если т.к. он уже был установлен в настройках");
		КонецЕсли;
	
	КонецЕсли;
	
КонецПроцедуры
